using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Task_2_1
{
    class Program
    {
        /*
         Задание 2 
         Используя Visual Studio, создайте проект по шаблону Console Application. 
         Требуется: 
         Создать класс Converter. 
         В теле класса создать пользовательский конструктор, который принимает три вещественных аргумента, 
         и инициализирует поля соответствующие курсу 3-х основных валют, по отношению к гривне – public
         Converter(double usd, double eur, double rub). 
         Написать программу, которая будет выполнять конвертацию из гривны в одну из указанных валют, 
         также программа должна производить конвертацию из указанных валют в гривну. 
         */
        static void Main(string[] args)
        {
            decimal ua, usd, eur, rub;
            Console.WriteLine("");
        }
        static decimal Add(decimal ua,decimal rub)
        {
            return ua * rub;
        }
        static decimal Converter(valuta)
        {

        }
        static double Kalc(int operand1,int operand2)
        {
            return result;
        }
    }
}
